[
  {
    "id": "faq-gms",
    "question": "Why do your apps require Google Play Services?",
    "iconSymbol": "support_agent",
    "featured": true,
    "homeAnswerHtml": "\n                <p>\n                  My apps rely on Firebase tools, Google Ads / AdMob, in-app updates,\n                  and in-app reviews to deliver analytics, crash reporting, and\n                  monetization features that keep development sustainable.\n                </p>\n                <p>\n                  Without Play Services, ads, update prompts, or performance\n                  telemetry would stop working, so the Play Store build remains the\n                  most stable way to ship new features.\n                </p>\n            ",
    "answerHtml": "\n                <p>\n                  My apps integrate several components from Google Play Services because they\n                  provide reliable, well-maintained solutions for everyday needs:\n                </p>\n                <ul>\n                  <li><strong>Firebase Analytics, Performance, and Crashlytics</strong> keep me informed about stability issues\nand feature adoption.</li>\n                  <li><strong>Google Ads / AdMob</strong> offsets the costs of hosting, design tools, and test devices.</li>\n                  <li><strong>In-App Reviews & Play In-App Updates</strong> help deliver a polished experience without forcing manual store checks.</li>\n                </ul>\n                <p>\n                  Removing these SDKs would mean rewriting entire systems from scratch and\n                  losing the telemetry that keeps the apps healthy. For now, the Play Store\n                  build remains the most sustainable option for both me and the people using\n                  the apps every day.\n                </p>\n            "
  },
  {
    "id": "faq-fdroid",
    "question": "Why aren’t your apps on F-Droid or other stores?",
    "iconSymbol": "storefront",
    "featured": true,
    "homeAnswerHtml": "\n                <p>\n                  F-Droid’s policies exclude proprietary SDKs like Play Services,\n                  AdMob, and Firebase—exactly the technologies that power my apps’\n                  analytics and compliance.\n                </p>\n                <p>\n                  To guarantee verified, policy-compliant builds, I distribute\n                  exclusively through Google Play and mirrored releases on GitHub.\n                </p>\n            ",
    "answerHtml": "\n                <p>\n                  I love the open-source mindset behind F-Droid and similar stores. However,\n                  their repository policies prevent shipping binaries that rely on\n                  proprietary SDKs like Play Services, AdMob, or Firebase.\n                </p>\n                <p>\n                  Because those SDKs are essential to my workflow, the apps currently would\n                  not pass F-Droid’s inclusion checks. To avoid confusing, unverified builds\n                  scattered across the web, I focus distribution on:\n                </p>\n                <ul>\n                  <li><strong>Google Play Store</strong> for the primary, auto-updated release.</li>\n                  <li><strong>GitHub Releases</strong> for developers who prefer sideloading directly from me.</li>\n                </ul>\n                <p>\n                  That combination guarantees fast updates, verified signatures, and clear\n                  communication around policy changes.\n                </p>\n            "
  },
  {
    "id": "faq-analytics",
    "question": "Why do you use analytics and ads at all?",
    "iconSymbol": "insights",
    "featured": true,
    "homeAnswerHtml": "\n                <p>\n                  Building and maintaining apps involves hosting, testing devices,\n                  and tool licenses. Ads and anonymous analytics keep projects\n                  funded while revealing crashes or slowdowns before they affect\n                  everyone.\n                </p>\n                <p>\n                  I keep placements minimal and respectful so the experience stays\n                  focused on utility—not interruptions.\n                </p>\n            ",
    "answerHtml": "\n                <p>\n                  Independent development involves recurring costs: domain renewals, build\n                  tooling, Firebase quotas, music licensing, and a growing fleet of test\n                  devices. Anonymous analytics and respectful advertising make it possible to\n                  keep the apps free while still covering those expenses.\n                </p>\n                <p>\n                  Metrics such as screen load time, crash frequency, and feature usage help\n                  me prioritize fixes and improvements. Ads are placed sparingly and follow\n                  Google’s content policies so they remain as unobtrusive as possible.\n                </p>\n            "
  },
  {
    "id": "faq-privacy",
    "question": "Do you collect personal data?",
    "iconSymbol": "shield_person",
    "featured": true,
    "homeAnswerHtml": "\n                <p>\n                  I don’t sell or personally collect user data. Google’s SDKs handle\n                  analytics and ads according to their privacy policy, while I only\n                  review aggregated trends like active installs or crash types.\n                </p>\n                <p>\n                  Read the full details in my\n                  <a href=\"#privacy-policy\">Privacy Policy</a> for transparency on\n                  data processing.\n                </p>\n            ",
    "answerHtml": "\n                <p>\n                  I do not personally collect, store, or sell any individual user data. All\n                  analytics and advertising are handled by Google’s SDKs under their\n                  <a href=\"https://policies.google.com/privacy\" target=\"_blank\" rel=\"noopener noreferrer\">Privacy Policy</a>.\n                </p>\n                <p>\n                  The dashboards I see only include aggregated, anonymous information—for\n                  example, how many people opened the app this week or which device model is\n                  crashing after a new release. You can always review the\n                  <a href=\"#privacy-policy\">website privacy policy</a> for the full breakdown\n                  of how data is processed and how you can opt out.\n                </p>\n            "
  },
  {
    "id": "faq-gms-free",
    "question": "Will you ever make GMS-free or F-Droid builds?",
    "iconSymbol": "build",
    "answerHtml": "\n                <p>\n                  I have explored prototypes of lightweight, offline-friendly builds. The\n                  challenge is maintaining two separate release pipelines, testing matrices,\n                  and support documents—effectively doubling the workload for every update.\n                </p>\n                <p>\n                  For now, consolidating around a single Play Store release lets me deliver\n                  modern APIs such as Firebase Remote Config, Play Integrity, and in-app\n                  reviews faster. If a practical, sustainable path to a GMS-free edition\n                  appears, I will share updates in the news feed and on GitHub.\n                </p>\n            "
  },
  {
    "id": "faq-support",
    "question": "How can I support your work without ads?",
    "iconSymbol": "volunteer_activism",
    "answerHtml": "\n                <p>\n                  If you prefer ad-free support, here are the most impactful options:\n                </p>\n                <ul>\n                  <li>Leave a positive review or rating on the Google Play Store.</li>\n                  <li>Share the apps with friends, family, or communities that may benefit.</li>\n                  <li>Explore my music and creative projects released under <strong>D4rK Rekords</strong>.</li>\n                </ul>\n                <p>\n                  Every signal of support fuels future updates and allows me to experiment\n                  with new ideas that benefit the entire community.\n                </p>\n            "
  },
  {
    "id": "faq-downloads",
    "question": "Where can I find official builds?",
    "iconSymbol": "cloud_download",
    "answerHtml": "\n                <p>\n                  Stick to these trusted sources to ensure you are downloading authentic,\n                  malware-free builds directly from me:\n                </p>\n                <ul>\n                  <li><strong>Google Play Store</strong> – the primary distribution channel with automatic updates.</li>\n                  <li><strong>GitHub Releases</strong> – mirrors the Play build for sideloading or archival purposes.</li>\n                </ul>\n                <p>\n                  Third-party APK mirrors are not verified or monitored, so they might host\n                  outdated versions or tampered packages. When in doubt, always circle back\n                  to the official listings above.\n                </p>\n            "
  }
]
